# pandas libray

In [1]:
# how to install pandas

! pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

[notice] A new release of pip is available: 24.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

### all libraries used in this code

In [93]:
import pandas as pd

padas import types for data
1. series
2. dataframe

## 1. series

In [8]:
# make a list 
 
num = [1,2,4,5,6,7,8,9,6]

ser = pd.Series(num)

ser_index = pd.Series(num, index=['a','b','c','d','e','f','g','h','i'])

In [7]:
ser

0    1
1    2
2    4
3    5
4    6
5    7
6    8
7    9
8    6
dtype: int64

In [9]:
ser_index

a    1
b    2
c    4
d    5
e    6
f    7
g    8
h    9
i    6
dtype: int64

In [10]:
type(ser)

pandas.core.series.Series

In [13]:
ser.dtype

dtype('int64')

## 2. DataFrame

In [14]:
marks = {"ali":[32,64,64,87,43],
        "sidra":[98,78,94,35,78],
        "aamir":[23,24,47,24,12]}

In [17]:
marks

{'ali': [32, 64, 64, 87, 43],
 'sidra': [98, 78, 94, 35, 78],
 'aamir': [23, 24, 47, 24, 12]}

In [18]:
df = pd.DataFrame(marks)

In [19]:
df

   ali  sidra  aamir
0   32     98     23
1   64     78     24
2   64     94     47
3   87     35     24
4   43     78     12

In [30]:
a2d = [[3,5,5,3,4],
      [3,4,5,4,3],
      [3,5,5,3,4],
      [3,4,5,4,3],
      [3,4,5,4,3]]

In [31]:
a2d

[[3, 5, 5, 3, 4],
 [3, 4, 5, 4, 3],
 [3, 5, 5, 3, 4],
 [3, 4, 5, 4, 3],
 [3, 4, 5, 4, 3]]

In [41]:
df = pd.DataFrame(a2d)
df_index = pd.DataFrame(a2d, index= ['aamir','sidra','touseef','haris','uswa'])

In [42]:
df

   0  1  2  3  4
0  3  5  5  3  4
1  3  4  5  4  3
2  3  5  5  3  4
3  3  4  5  4  3
4  3  4  5  4  3

In [43]:
df_index

         0  1  2  3  4
aamir    3  5  5  3  4
sidra    3  4  5  4  3
touseef  3  5  5  3  4
haris    3  4  5  4  3
uswa     3  4  5  4  3

In [59]:
df = pd.DataFrame(a2d,
                  index= ['aamir','sidra','touseef','haris','uswa'], 
                  columns=["math", "physic","urdu","computer","bio"])

In [48]:
df

         math  physic  urdu  computer  bio
aamir       3       5     5         3    4
sidra       3       4     5         4    3
touseef     3       5     5         3    4
haris       3       4     5         4    3
uswa        3       4     5         4    3

In [49]:
# check the data types of all the columns
df.dtypes

math        int64
physic      int64
urdu        int64
computer    int64
bio         int64
dtype: object

In [50]:
# access the specifc column
df['urdu']

aamir      5
sidra      5
touseef    5
haris      5
uswa       5
Name: urdu, dtype: int64

In [51]:
# access the specific row

# loc function used to search by index name
df.loc["aamir"]

math        3
physic      5
urdu        5
computer    3
bio         4
Name: aamir, dtype: int64

In [52]:
# iloc is used to search by index value
df.iloc[1]

math        3
physic      4
urdu        5
computer    4
bio         3
Name: sidra, dtype: int64

In [57]:
# access the coulms of dataframe
df.columns

Index(['math', 'physic', 'urdu', 'computer', 'bio'], dtype='object')

In [73]:
# add the colum in the previous data frame 
df["sum"] = df["math"] + df["physic"] + df["urdu"] + df["bio"] + df["computer"]

In [74]:
df

         math  physic  urdu  computer  bio  sum
aamir       3       5     5         3    4   20
sidra       3       4     5         4    3   19
touseef     3       5     5         3    4   20
haris       3       4     5         4    3   19
uswa        3       4     5         4    3   19

In [68]:
# drop the sum column
df.drop("sum", axis=1)

         math  physic  urdu  computer  bio
aamir       3       5     5         3    4
sidra       3       4     5         4    3
touseef     3       5     5         3    4
haris       3       4     5         4    3
uswa        3       4     5         4    3

In [69]:
# check the dataframe 
df

         math  physic  urdu  computer  bio  sum
aamir       3       5     5         3    4   20
sidra       3       4     5         4    3   19
touseef     3       5     5         3    4   20
haris       3       4     5         4    3   19
uswa        3       4     5         4    3   19

In [75]:
# assign the opreation to main dataframe to store it permanentally 
df = df.drop("sum", axis=1)

In [76]:
df

         math  physic  urdu  computer  bio
aamir       3       5     5         3    4
sidra       3       4     5         4    3
touseef     3       5     5         3    4
haris       3       4     5         4    3
uswa        3       4     5         4    3

In [77]:
# another method (useful)

df.drop("bio", axis=1, inplace=True)
df

         math  physic  urdu  computer
aamir       3       5     5         3
sidra       3       4     5         4
touseef     3       5     5         3
haris       3       4     5         4
uswa        3       4     5         4

In [78]:
df["islamyat"] = [4,3,6,4,1]
df

         math  physic  urdu  computer  islamyat
aamir       3       5     5         3         4
sidra       3       4     5         4         3
touseef     3       5     5         3         6
haris       3       4     5         4         4
uswa        3       4     5         4         1

In [79]:
# by using print function 
print(df)

         math  physic  urdu  computer  islamyat
aamir       3       5     5         3         4
sidra       3       4     5         4         3
touseef     3       5     5         3         6
haris       3       4     5         4         4
uswa        3       4     5         4         1

In [81]:
# access one colums
df["math"]

aamir      3
sidra      3
touseef    3
haris      3
uswa       3
Name: math, dtype: int64

In [82]:
# another method to access the column
df.math

aamir      3
sidra      3
touseef    3
haris      3
uswa       3
Name: math, dtype: int64

In [83]:
df["computer"]>=4

aamir      False
sidra       True
touseef    False
haris       True
uswa        True
Name: computer, dtype: bool

In [84]:
df[df["computer"]>=4]

       math  physic  urdu  computer  islamyat
sidra     3       4     5         4         3
haris     3       4     5         4         4
uswa      3       4     5         4         1

In [86]:
df[df.islamyat>3]

         math  physic  urdu  computer  islamyat
aamir       3       5     5         3         4
touseef     3       5     5         3         6
haris       3       4     5         4         4

In [87]:
# top five
df.head()

         math  physic  urdu  computer  islamyat
aamir       3       5     5         3         4
sidra       3       4     5         4         3
touseef     3       5     5         3         6
haris       3       4     5         4         4
uswa        3       4     5         4         1

In [89]:
# top 2
df.head(2)

       math  physic  urdu  computer  islamyat
aamir     3       5     5         3         4
sidra     3       4     5         4         3

In [90]:
# last 5
df.tail()

         math  physic  urdu  computer  islamyat
aamir       3       5     5         3         4
sidra       3       4     5         4         3
touseef     3       5     5         3         6
haris       3       4     5         4         4
uswa        3       4     5         4         1

In [92]:
# last 2
df.tail(2)

       math  physic  urdu  computer  islamyat
haris     3       4     5         4         4
uswa      3       4     5         4         1

In [96]:
# dataframe from numpy array 
arr = np.array([[3,5,5,3,4],
      [3,4,5,4,3],
      [3,5,5,3,4],
      [3,4,5,4,3],
      [3,4,5,4,3]])

arr

array([[3, 5, 5, 3, 4],
       [3, 4, 5, 4, 3],
       [3, 5, 5, 3, 4],
       [3, 4, 5, 4, 3],
       [3, 4, 5, 4, 3]])

In [99]:
data = pd.DataFrame(arr, columns=["a","b","c","d","e"])
data

   a  b  c  d  e
0  3  5  5  3  4
1  3  4  5  4  3
2  3  5  5  3  4
3  3  4  5  4  3
4  3  4  5  4  3

### reading csv files and dataframe

In [103]:
data = pd.read_csv("data/laptop_price.csv", encoding="ISO-8859-1")

In [104]:
data

,laptop_ID,Company,Product,TypeName,Inches,ScreenResolution,Cpu,Ram,Memory,Gpu,OpSys,Weight,Price_euros
0,1,Apple,MacBook Pro,Ultrabook,13.3,IPS Panel Retina Display 2560x1600,Intel Core i5 2.3GHz,8GB,128GB SSD,Intel Iris Plus Graphics 640,macOS,1.37kg,1339.69
1,2,Apple,Macbook Air,Ultrabook,13.3,1440x900,Intel Core i5 1.8GHz,8GB,128GB Flash Storage,Intel HD Graphics 6000,macOS,1.34kg,898.94
2,3,HP,250 G6,Notebook,15.6,Full HD 1920x1080,Intel Core i5 7200U 2.5GHz,8GB,256GB SSD,Intel HD Graphics 620,No OS,1.86kg,575.00
3,4,Apple,MacBook Pro,Ultrabook,15.4,IPS Panel Retina Display 2880x1800,Intel Core i7 2.7GHz,16GB,512GB SSD,AMD Radeon Pro 455,macOS,1.83kg,2537.45
4,5,Apple,MacBook Pro,Ultrabook,13.3,IPS Panel Retina Display 2560x1600,Intel Core i5 3.1GHz,8GB,256GB SSD,Intel Iris Plus Graphics 650,macOS,1.37kg,1803.60
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1298,1316,Lenovo,Yoga 500-14ISK,2 in 1 Convertible,14.0,IPS Panel Full HD / Touchscreen 1920x1080,Intel Core i7 6500U 2.5GHz,4GB,128GB SSD,Intel HD Graphics 520,Windows 10,1.8kg,638.00
1299,1317,Lenovo,Yoga 900-13ISK,2 in 1 Convertible,13.3,IPS Panel Quad HD+ / Touchscreen 3200x1800,Intel Core i7 6500U 2.5GHz,16GB,512GB SSD,Intel HD Graphics 520,Windows 10,1.3kg,1499.00
1300,1318,Lenovo,IdeaPad 100S-14IBR,Notebook,14.0,1366x768,Intel Celeron Dual Core N3050 1.6GHz,2GB,64GB Flash Storage,Intel HD Graphics,Windows 10,1.5kg,229.00
1301,1319,HP,15-AC110nv (i7-6500U/6GB/1TB/Radeon,Notebook,15.6,1366x768,Intel Core i7 6500U 2.5GHz,6GB,1TB HDD,AMD Radeon R5 M330,Windows 10,2.19kg,764.00
1302,1320,Asus,X553SA-XX031T (N3050/4GB/500GB/W10),Notebook,15.6,1366x768,Intel Celeron Dual Core N3050 1.6GHz,4GB,500GB HDD,Intel HD Graphics,Windows 10,2.2kg,369.00

In [106]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1303 entries, 0 to 1302
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   laptop_ID         1303 non-null   int64
 1   Company           1303 non-null   object
 2   Product           1303 non-null   object
 3   TypeName          1303 non-null   object
 4   Inches            1303 non-null   float64
 5   ScreenResolution  1303 non-null   object
 6   Cpu               1303 non-null   object
 7   Ram               1303 non-null   object
 8   Memory            1303 non-null   object
 9   Gpu               1303 non-null   object
 10  OpSys             1303 non-null   object
 11  Weight            1303 non-null   object
 12  Price_euros       1303 non-null   float64
dtypes: float64(2), int64(1), object(10)
memory usage: 132.5+ KB

In [107]:
data.dtypes

laptop_ID             int64
Company              object
Product              object
TypeName             object
Inches              float64
ScreenResolution     object
Cpu                  object
Ram                  object
Memory               object
Gpu                  object
OpSys                object
Weight               object
Price_euros         float64
dtype: object

In [109]:
data.head()

,laptop_ID,Company,Product,TypeName,Inches,ScreenResolution,Cpu,Ram,Memory,Gpu,OpSys,Weight,Price_euros
0,1,Apple,MacBook Pro,Ultrabook,13.3,IPS Panel Retina Display 2560x1600,Intel Core i5 2.3GHz,8GB,128GB SSD,Intel Iris Plus Graphics 640,macOS,1.37kg,1339.69
1,2,Apple,Macbook Air,Ultrabook,13.3,1440x900,Intel Core i5 1.8GHz,8GB,128GB Flash Storage,Intel HD Graphics 6000,macOS,1.34kg,898.94
2,3,HP,250 G6,Notebook,15.6,Full HD 1920x1080,Intel Core i5 7200U 2.5GHz,8GB,256GB SSD,Intel HD Graphics 620,No OS,1.86kg,575.00
3,4,Apple,MacBook Pro,Ultrabook,15.4,IPS Panel Retina Display 2880x1800,Intel Core i7 2.7GHz,16GB,512GB SSD,AMD Radeon Pro 455,macOS,1.83kg,2537.45
4,5,Apple,MacBook Pro,Ultrabook,13.3,IPS Panel Retina Display 2560x1600,Intel Core i5 3.1GHz,8GB,256GB SSD,Intel Iris Plus Graphics 650,macOS,1.37kg,1803.60

In [110]:
data.tail()

,laptop_ID,Company,Product,TypeName,Inches,ScreenResolution,Cpu,Ram,Memory,Gpu,OpSys,Weight,Price_euros
1298,1316,Lenovo,Yoga 500-14ISK,2 in 1 Convertible,14.0,IPS Panel Full HD / Touchscreen 1920x1080,Intel Core i7 6500U 2.5GHz,4GB,128GB SSD,Intel HD Graphics 520,Windows 10,1.8kg,638.0
1299,1317,Lenovo,Yoga 900-13ISK,2 in 1 Convertible,13.3,IPS Panel Quad HD+ / Touchscreen 3200x1800,Intel Core i7 6500U 2.5GHz,16GB,512GB SSD,Intel HD Graphics 520,Windows 10,1.3kg,1499.0
1300,1318,Lenovo,IdeaPad 100S-14IBR,Notebook,14.0,1366x768,Intel Celeron Dual Core N3050 1.6GHz,2GB,64GB Flash Storage,Intel HD Graphics,Windows 10,1.5kg,229.0
1301,1319,HP,15-AC110nv (i7-6500U/6GB/1TB/Radeon,Notebook,15.6,1366x768,Intel Core i7 6500U 2.5GHz,6GB,1TB HDD,AMD Radeon R5 M330,Windows 10,2.19kg,764.0
1302,1320,Asus,X553SA-XX031T (N3050/4GB/500GB/W10),Notebook,15.6,1366x768,Intel Celeron Dual Core N3050 1.6GHz,4GB,500GB HDD,Intel HD Graphics,Windows 10,2.2kg,369.0

In [112]:
data.shape

(1303, 13)

In [116]:
data.isnull().sum()

laptop_ID           0
Company             0
Product             0
TypeName            0
Inches              0
ScreenResolution    0
Cpu                 0
Ram                 0
Memory              0
Gpu                 0
OpSys               0
Weight              0
Price_euros         0
dtype: int64

In [117]:
data.describe()

         laptop_ID       Inches  Price_euros
count  1303.000000  1303.000000  1303.000000
mean    660.155794    15.017191  1123.686992
std     381.172104     1.426304   699.009043
min       1.000000    10.100000   174.000000
25%     331.500000    14.000000   599.000000
50%     659.000000    15.600000   977.000000
75%     990.500000    15.600000  1487.880000
max    1320.000000    18.400000  6099.000000

In [123]:
data.Price_euros

1464164.15

In [125]:
data.Company

0        Apple
1        Apple
2           HP
3        Apple
4        Apple
         ...
1298    Lenovo
1299    Lenovo
1300    Lenovo
1301        HP
1302      Asus
Name: Company, Length: 1303, dtype: object

In [127]:
data.Company.value_counts()

Dell         297
Lenovo       297
HP           274
Asus         158
Acer         103
MSI           54
Toshiba       48
Apple         21
Samsung        9
Razer          7
Mediacom       7
Microsoft      6
Xiaomi         4
Vero           4
Chuwi          3
Google         3
Fujitsu        3
LG             3
Huawei         2
Name: Company, dtype: int64

In [128]:
data.Company.unique()

array(['Apple', 'HP', 'Acer', 'Asus', 'Dell', 'Lenovo', 'Chuwi', 'MSI',
       'Microsoft', 'Toshiba', 'Huawei', 'Xiaomi', 'Vero', 'Razer',
       'Mediacom', 'Samsung', 'Google', 'Fujitsu', 'LG'], dtype=object)

In [129]:
data.Ram.value_counts()

8GB     619
4GB     375
16GB    200
6GB      41
12GB     25
2GB      22
32GB     17
24GB      3
64GB      1
Name: Ram, dtype: int64

In [131]:
# Remove 'GB' and convert to integer
data['Ram'] = data['Ram'].str.replace('GB', '')

In [132]:
data.Ram

0        8
1        8
2        8
3       16
4        8
        ..
1298     4
1299    16
1300     2
1301     6
1302     4
Name: Ram, Length: 1303, dtype: object

In [134]:
data.Ram.dtype

dtype('O')

In [135]:
data["Ram"] = data["Ram"].astype(int)

In [137]:
data.Ram

0        8
1        8
2        8
3       16
4        8
        ..
1298     4
1299    16
1300     2
1301     6
1302     4
Name: Ram, Length: 1303, dtype: int32

In [138]:
# sort data according to ram in asending order
data = data.sort_values(by="Ram", ascending= True)
data

,laptop_ID,Company,Product,TypeName,Inches,ScreenResolution,Cpu,Ram,Memory,Gpu,OpSys,Weight,Price_euros
1041,1055,Vero,V142 (X5-Z8350/2GB/32GB/W10),Notebook,14.0,1366x768,Intel Atom X5-Z8350 1.44GHz,2,32GB Flash Storage,Intel HD Graphics 400,Windows 10,1.45kg,210.8
20,21,Asus,Vivobook E200HA,Netbook,11.6,1366x768,Intel Atom x5-Z8350 1.44GHz,2,32GB Flash Storage,Intel HD Graphics 400,Windows 10,0.98kg,191.9
637,645,Lenovo,IdeaPad 100S-14IBR,Notebook,14.0,1366x768,Intel Celeron Dual Core N3060 1.6GHz,2,32GB Flash Storage,Intel HD Graphics 400,Windows 10,1.42kg,249.0
1282,1300,HP,Stream 11-Y000na,Netbook,11.6,1366x768,Intel Celeron Dual Core N3060 1.6GHz,2,32GB Flash Storage,Intel HD Graphics 400,Windows 10,1.17kg,209.0
346,352,HP,Stream 14-AX001nv,Notebook,14.0,1366x768,Intel Celeron Dual Core N3060 1.6GHz,2,32GB Flash Storage,Intel HD Graphics 400,Windows 10,1.44kg,279.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
901,913,Asus,G701VO-IH74K (i7-6820HK/32GB/2x,Gaming,17.3,IPS Panel Full HD 1920x1080,Intel Core i7 6820HK 2.7GHz,32,256GB SSD + 256GB SSD,Nvidia GeForce GTX 980M,Windows 10,3.58kg,1279.0
723,731,Dell,Alienware 17,Gaming,17.3,4K Ultra HD 3840x2160,Intel Core i7 7700HQ 2.8GHz,32,1TB SSD + 1TB HDD,Nvidia GeForce GTX 1070,Windows 10,4.36kg,3659.4
968,982,Dell,Alienware 17,Gaming,17.3,IPS Panel Full HD 1920x1080,Intel Core i7 7700HQ 2.8GHz,32,256GB SSD + 1TB HDD,Nvidia GeForce GTX 1070,Windows 10,4.42kg,3149.0
177,181,MSI,GT80S 6QF-074US,Gaming,18.4,Full HD 1920x1080,Intel Core i7 6920HQ 2.9GHz,32,512GB SSD + 1TB HDD,Nvidia GTX 980 SLI,Windows 10,4.4kg,2799.0
1066,1081,Asus,ROG G701VO,Gaming,17.3,IPS Panel Full HD 1920x1080,Intel Core i7 6820HK 2.7GHz,64,1TB SSD,Nvidia GeForce GTX 980,Windows 10,3.58kg,3975.0

In [140]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df.set_index('A')

   B
A
1  4
2  5
3  6

In [142]:

df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
print(df.reset_index())

   index  A  B
0      0  1  4
1      1  2  5
2      2  3  6

In [143]:
import numpy as np
df = pd.DataFrame({'A': [np.nan, 2, 3], 'B': [4, 5, np.nan]})
print(df.dropna(axis=1))

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [144]:
df

     A    B
0  NaN  4.0
1  2.0  5.0
2  3.0  NaN

In [146]:
df.isna().sum()

A    1
B    1
dtype: int64

In [147]:
df.isna().sum().sum()

2

In [152]:
df.sum(axis=0)

A    5.0
B    9.0
dtype: float64

In [155]:
import matplotlib.pyplot as plt
%matplotlib inline